
// framework
#include <framework_btn.h>

// samylib
#include <mystdout.h>
#include <usart.h>

// WinAVR
#include <avr/io.h>
#include <avr/interrupt.h>
#include <avr/pgmspace.h>

// STD-C
#include <stdio.h>


/****************************************************************************/
/* 定数宣言																	*/
/****************************************************************************/


/****************************************************************************/
/* マクロ宣言																*/
/****************************************************************************/


/****************************************************************************/
/* 構造体型宣言																*/
/****************************************************************************/


/****************************************************************************/
/* 割り込み動作制御変数														*/
/****************************************************************************/


/****************************************************************************/
/* イベント通知制御変数														*/
/****************************************************************************/


/****************************************************************************/
/* プロトタイプ宣言															*/
/****************************************************************************/

static VOID btn_print_sub( FILE* const fh, T_BTN_CTRL* const pt_btn, UCHAR btn_no )
{
	fprintf_P( fh, PSTR("gt_pcint%u_btn.uc_port_stat           = %u\n"), btn_no, pt_btn->uc_port_stat );
	fprintf_P( fh, PSTR("gt_pcint%u_btn.t_stat                 = %u\n"), btn_no, pt_btn->t_stat );
	fprintf_P( fh, PSTR("gt_pcint%u_btn.t_chatt_wait_count     = %u\n"), btn_no, pt_btn->t_chatt_wait_count );
	fprintf_P( fh, PSTR("gt_pcint%u_btn.t_long_push_wait_count = %u\n"), btn_no, pt_btn->t_long_push_wait_count );
}

/*----------------------------------------------*/
/* ボタン状態表示								*/
/*----------------------------------------------*/
VOID btn_print( FILE* const fh )
{
#ifdef CO_ENABLE_PCINT10_BTN
	btn_print_sub( fh, &gt_pcint10_btn, 10 );
#endif
#ifdef CO_ENABLE_PCINT11_BTN
	btn_print_sub( fh, &gt_pcint11_btn, 11 );
#endif
}

